#  Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет)
#  и метод running (запуск). Атрибут реализовать как приватный. В рамках метода реализовать
#  переключение светофора в режимы: красный, желтый, зеленый. Продолжительность первого
#  состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) —
#  на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном
#  порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав
#  описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить
# соответствующее сообщение и завершать скрипт.

import time


class TrafficLight:
    __color = ['red', 'yellow', 'green']

    def running(self):
        def get_time(color_item):
            if color_item == 'red':
                print('red')
                time.sleep(7)
            elif color_item == 'yellow':
                print('yellow')
                time.sleep(2)
            else:
                print('green')
                time.sleep(10)

        for el in self.__color:
            get_time(el)


obj = TrafficLight()
obj.running()
